Revit 2024 API
ParameterTypeId.BoundaryParamPreset Property
 "State"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BoundaryParamPreset { get; }
Visual Basic
Public Shared ReadOnly Property BoundaryParamPreset As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BoundaryParamPreset {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace